starlingcode/via_archive/Documents/stm32 workspace/onetouchkey/Src/main.c
void SetFlags(void){
	if (uhTSCAcquisitionValue3 < 2320) {
	    	not2 = 1;
	    	not1 = 1;}
	    else {
	    	not2 = 0;
	        not1 = 0;};
	    if (uhTSCAcquisitionValue1 < 1845) {
	        	not3 = 1;
	        	not2 = 1;}
	        else {
	        	not3 = 0;
	            not2 = 0;};
	    if (uhTSCAcquisitionValue2 < 2300) {
	           	not3 = 1;
	           	not1 = 1;}
	           else {
	           	not3 = 0;
	            not1 = 0;};
	    if (not1 == 0 && not2 == 1 && not3 == 0) {flag1 = 1;
	    		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_SET);}
	    else {HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_RESET);
	    		flag1 = 0;}
	    if (not1 == 1 && not2 == 0 && not3 == 1) {flag2 = 1;
	        		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET);}
	        else {HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET);
	        			flag2 = 0;}
	    if (not1 == 1 && not2 == 1 && not3 == 1) {flag3 = 1;
	            		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_SET);}
	            else {HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_RESET);
	            		flag3 = 0;}
}

void ChangeMode(void) {
		if (flag1 > temp1) {
			mode1 = (mode1 + 1) % 2;
		}
		if (flag2 > temp2) {
			mode2 = (mode2 + 1) % 3;
		}
		if (flag3 > temp3) {
			mode3 = (mode3 + 1) % 4;
		}
		temp1 = flag1;
		temp2 = flag2;
		temp3 = flag3;
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
